# Rebar Bend Data Constructor

Source: https://www.revitapidocs.com/2026/4d1aabbd-79b2-617f-151b-2e4097c8a4d5.htm

---

| Rebar Bend Data Constructor |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | RebarBendData | Constructs a new RebarBendData with default settings. |
|  | RebarBendData(RebarBarType, RebarStyle, BarTerminationsData) | Constructs a new RebarBendData using the bar type, style and termination's values. |
|  | RebarBendData(RebarBarType, RebarHookType, RebarHookType, RebarStyle, RebarHookOrientation, RebarHookOrientation) | **Obsolete.** Constructs a new RebarBendData using the bar type, hook types, style and orientation values. |

Top See Also

#### Reference

RebarBendData Class Autodesk.Revit.DB.Structure Namespace